keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_regdef.h
/** \\brief  Global Configuration Register */
typedef struct _Ifx_DSADC_GLOBCFG_Bits
{
    unsigned int MCSEL:3;                   /**< \brief [2:0] Modulator Clock Select (rw) */
    unsigned int reserved_3:8;              /**< \brief \internal Reserved */
    unsigned int IRM0:1;                    /**< \brief [11:11] Internal Resistance Measurement Control (rw) */
    unsigned int IRM2:1;                    /**< \brief [12:12] Internal Resistance Measurement Control (rw) */
    unsigned int IRM4:1;                    /**< \brief [13:13] Internal Resistance Measurement Control (rw) */
    unsigned int IRM6:1;                    /**< \brief [14:14] Internal Resistance Measurement Control (rw) */
    unsigned int IRM8:1;                    /**< \brief [15:15] Internal Resistance Measurement Control (rw) */
    unsigned int IBSEL:4;                   /**< \brief [19:16] Bias Current SelectThis is a preset value. Do not change this value when writing to GLOBCFG, unless there is an explicit recommendation. (rw) */
    unsigned int LOSUP:1;                   /**< \brief [20:20] Low Power Supply Voltage Select (rw) */
    unsigned int reserved_21:1;             /**< \brief \internal Reserved */
    unsigned int ICT:1;                     /**< \brief [22:22] Internal Channel Test (rw) */
    unsigned int PSWC:1;                    /**< \brief [23:23] Write Control for Power Supply Parameters (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBCFG_Bits;

/** \\brief  Global Run Control Register */
typedef struct _Ifx_DSADC_GLOBRC_Bits
{
    unsigned int CH0RUN:1;                  /**< \brief [0:0] Channel x Run Control (rw) */
    unsigned int CH1RUN:1;                  /**< \brief [1:1] Channel x Run Control (rw) */
    unsigned int CH2RUN:1;                  /**< \brief [2:2] Channel x Run Control (rw) */
    unsigned int CH3RUN:1;                  /**< \brief [3:3] Channel x Run Control (rw) */
    unsigned int CH4RUN:1;                  /**< \brief [4:4] Channel x Run Control (rw) */
    unsigned int CH5RUN:1;                  /**< \brief [5:5] Channel x Run Control (rw) */
    unsigned int CH6RUN:1;                  /**< \brief [6:6] Channel x Run Control (rw) */
    unsigned int CH7RUN:1;                  /**< \brief [7:7] Channel x Run Control (rw) */
    unsigned int CH8RUN:1;                  /**< \brief [8:8] Channel x Run Control (rw) */
    unsigned int CH9RUN:1;                  /**< \brief [9:9] Channel x Run Control (rw) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int M0RUN:1;                   /**< \brief [16:16] Modulator x Run Control (rw) */
    unsigned int M1RUN:1;                   /**< \brief [17:17] Modulator x Run Control (rw) */
    unsigned int M2RUN:1;                   /**< \brief [18:18] Modulator x Run Control (rw) */
    unsigned int M3RUN:1;                   /**< \brief [19:19] Modulator x Run Control (rw) */
    unsigned int M4RUN:1;                   /**< \brief [20:20] Modulator x Run Control (rw) */
    unsigned int M5RUN:1;                   /**< \brief [21:21] Modulator x Run Control (rw) */
    unsigned int M6RUN:1;                   /**< \brief [22:22] Modulator x Run Control (rw) */
    unsigned int M7RUN:1;                   /**< \brief [23:23] Modulator x Run Control (rw) */
    unsigned int M8RUN:1;                   /**< \brief [24:24] Modulator x Run Control (rw) */
    unsigned int M9RUN:1;                   /**< \brief [25:25] Modulator x Run Control (rw) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBRC_Bits;

/** \\brief  Common Mode Hold Voltage Register 0 */
typedef struct _Ifx_DSADC_GLOBVCMH0_Bits
{
    unsigned int IN0PVC0:1;                 /**< \brief [0:0] Voltage Control of Positive Input 0 of CH0 (rw) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int IN0NVC0:1;                 /**< \brief [4:4] Voltage Control of Negative Input 0 of CH0 (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int IN1PVC0:1;                 /**< \brief [8:8] Voltage Control of Positive Input 0 of CH1 (rw) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int IN1NVC0:1;                 /**< \brief [12:12] Voltage Control of Negative Input 0 of CH1 (rw) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int IN2PVC0:1;                 /**< \brief [16:16] Voltage Control of Positive Inputs 0-1 of CH2 (rw) */
    unsigned int IN2PVC1:1;                 /**< \brief [17:17] Voltage Control of Positive Inputs 0-1 of CH2 (rw) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int IN2NVC0:1;                 /**< \brief [20:20] Voltage Control of Negative Inputs 0-1 of CH2 (rw) */
    unsigned int IN2NVC1:1;                 /**< \brief [21:21] Voltage Control of Negative Inputs 0-1 of CH2 (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int IN3PVC0:1;                 /**< \brief [24:24] Voltage Control of Positive Inputs 0-3 of CH3 (rw) */
    unsigned int IN3PVC1:1;                 /**< \brief [25:25] Voltage Control of Positive Inputs 0-3 of CH3 (rw) */
    unsigned int IN3PVC2:1;                 /**< \brief [26:26] Voltage Control of Positive Inputs 0-3 of CH3 (rw) */
    unsigned int IN3PVC3:1;                 /**< \brief [27:27] Voltage Control of Positive Inputs 0-3 of CH3 (rw) */
    unsigned int IN3NVC0:1;                 /**< \brief [28:28] Voltage Control of Negative Inputs 0-3 of CH3 (rw) */
    unsigned int IN3NVC1:1;                 /**< \brief [29:29] Voltage Control of Negative Inputs 0-3 of CH3 (rw) */
    unsigned int IN3NVC2:1;                 /**< \brief [30:30] Voltage Control of Negative Inputs 0-3 of CH3 (rw) */
    unsigned int IN3NVC3:1;                 /**< \brief [31:31] Voltage Control of Negative Inputs 0-3 of CH3 (rw) */
} Ifx_DSADC_GLOBVCMH0_Bits;

