keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_regdef.h
/** \\brief  Common Mode Hold Voltage Register 1 */
typedef struct _Ifx_DSADC_GLOBVCMH1_Bits
{
    unsigned int IN4PVC0:1;                 /**< \brief [0:0] Voltage Control of Positive Input 0 of CH4 (rw) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int IN4NVC0:1;                 /**< \brief [4:4] Voltage Control of Negative Input 0 of CH4 (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int IN5PVC0:1;                 /**< \brief [8:8] Voltage Control of Positive Input 0 of CH5 (rw) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int IN5NVC0:1;                 /**< \brief [12:12] Voltage Control of Negative Input 0 of CH5 (rw) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int IN6PVC0:1;                 /**< \brief [16:16] Voltage Control of Positive Inputs 0-1 of CH6 (rw) */
    unsigned int IN6PVC1:1;                 /**< \brief [17:17] Voltage Control of Positive Inputs 0-1 of CH6 (rw) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int IN6NVC0:1;                 /**< \brief [20:20] Voltage Control of Negative Inputs 0-1 of CH6 (rw) */
    unsigned int IN6NVC1:1;                 /**< \brief [21:21] Voltage Control of Negative Inputs 0-1 of CH6 (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int IN7PVC0:1;                 /**< \brief [24:24] Voltage Control of Positive Inputs 0-1 of CH7 (rw) */
    unsigned int IN7PVC1:1;                 /**< \brief [25:25] Voltage Control of Positive Inputs 0-1 of CH7 (rw) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int IN7NVC0:1;                 /**< \brief [28:28] Voltage Control of Negative Inputs 0-1 of CH7 (rw) */
    unsigned int IN7NVC1:1;                 /**< \brief [29:29] Voltage Control of Negative Inputs 0-1 of CH7 (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBVCMH1_Bits;

/** \\brief  Common Mode Hold Voltage Register 2 */
typedef struct _Ifx_DSADC_GLOBVCMH2_Bits
{
    unsigned int IN8PVC0:1;                 /**< \brief [0:0] Voltage Control of Positive Inputs y of CH8 (rw) */
    unsigned int IN8PVC1:1;                 /**< \brief [1:1] Voltage Control of Positive Inputs y of CH8 (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int IN8NVC0:1;                 /**< \brief [4:4] Voltage Control of Negative Inputs y of CH8 (rw) */
    unsigned int IN8NVC1:1;                 /**< \brief [5:5] Voltage Control of Negative Inputs y of CH8 (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int IN9PVC0:1;                 /**< \brief [8:8] Voltage Control of Positive Input 0 of CH9 (rw) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int IN9NVC0:1;                 /**< \brief [12:12] Voltage Control of Negative Input 0 of CH9 (rw) */
    unsigned int reserved_13:16;            /**< \brief \internal Reserved */
    unsigned int VHON:1;                    /**< \brief [29:29] Common Mode Hold Voltage On (rw) */
    unsigned int VCMHS:2;                   /**< \brief [31:30] Common Mode Hold Voltage Selection (rw) */
} Ifx_DSADC_GLOBVCMH2_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_DSADC_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_DSADC_ID_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_DSADC_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_DSADC_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_DSADC_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRSTCLR_Bits;

/** \\brief  OCDS Control and Status Register */
typedef struct _Ifx_DSADC_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_DSADC_OCS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dsadc_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_ACCEN0_Bits B;
} Ifx_DSADC_ACCEN0;

/** \\brief  Access Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_ACCPROT_Bits B;
} Ifx_DSADC_ACCPROT;

